/* automatically generated by rust-bindgen 0.58.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImageInfoContainer {
    pub make: *const ::std::os::raw::c_char,
    pub model: *const ::std::os::raw::c_char,
    pub width: ::std::os::raw::c_ushort,
    pub height: ::std::os::raw::c_ushort,
    pub black_levels: [f64; 4usize],
    pub white_levels: [f64; 4usize],
    pub camera_neutral: [f64; 3usize],
    pub xyz_to_cam: [[f32; 3usize]; 3usize],
}
#[test]
fn bindgen_test_layout_ImageInfoContainer() {
    assert_eq!(
        ::std::mem::size_of::<ImageInfoContainer>(),
        152usize,
        concat!("Size of: ", stringify!(ImageInfoContainer))
    );
    assert_eq!(
        ::std::mem::align_of::<ImageInfoContainer>(),
        8usize,
        concat!("Alignment of ", stringify!(ImageInfoContainer))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ImageInfoContainer>())).make as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImageInfoContainer),
            "::",
            stringify!(make)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ImageInfoContainer>())).model as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImageInfoContainer),
            "::",
            stringify!(model)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ImageInfoContainer>())).width as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImageInfoContainer),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ImageInfoContainer>())).height as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(ImageInfoContainer),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ImageInfoContainer>())).black_levels as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ImageInfoContainer),
            "::",
            stringify!(black_levels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ImageInfoContainer>())).white_levels as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ImageInfoContainer),
            "::",
            stringify!(white_levels)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ImageInfoContainer>())).camera_neutral as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ImageInfoContainer),
            "::",
            stringify!(camera_neutral)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ImageInfoContainer>())).xyz_to_cam as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ImageInfoContainer),
            "::",
            stringify!(xyz_to_cam)
        )
    );
}
